"""
Реализовать функцию get_jokes(), возвращающую n шуток, сформированных из двух случайных слов, взятых из трёх списков:
nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]
        Например:
get_jokes(2)
["лес завтра зеленый", "город вчера веселый"]
"""

from random import choice


def get_jokes(n):
    """
    Функция возвращает шутки в количестве, запрошенным пользователем
    :param n: Количество генераций
    :return:
    """
    nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
    adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
    adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]
    list_of_jokes = []
    i = 0
    while i < n:
        joke = f'{choice(nouns)} {choice(adverbs)} {choice(adjectives)}'
        list_of_jokes.append(joke)
        i += 1
    print(list_of_jokes)


get_jokes(5)
